package com.lab3.data

/**
 * ItemsData - singleton class (only one instance) can be the example of shared data source
 * You can get the data from this ItemsData object from any place in the code.
 */
object ItemsData {
    // Static list with the items of Item
    val itemsList = listOf(
        Item(1, "Високий замок", "За час правління короля Данила, князя Лева та їхніх послідовників на території найвищих міських пагорбів знаходився фортифікаційний комплекс, а на схилах сучасного парку відповідно розвивався середньовічний Львів. Сьогодні тут знаходиться місцевість з відголосом до історичної назви - “Підзамче”. Зведені з дерева найстаріші будівлі на жаль не збереглися."),
        Item(2, "Ратуша", "З'явилася у XIV столітті внаслідок надання місту магдебурзького права, що означало міське самоврядування на противагу влади монарха. Давні привілеї та забезпечення комфортного проживання в місті створили умови ведення торгівлі та ремесел для німців, русинів, поляків, євреїв, вірмен та навіть сарацинів."),
        Item(3, "Площа ринок", "   Eпіцентр серцебиття міста. На головній площі розташований сучасний магістрат (Львівська ратуша) та найцікавіші кам'яниці середмістя. Красиві та різнобарвні будинки ще кілька століть тому відігравали роль торгово-промислових приміщень та представництв крамарів різних національностей."),
        )
}

// Item class
class Item(val id: Int, val title: String, val description: String)